# Homework 2: Pandas


Homework 2 is out, it is notebook form. You need to fill in the answers in the cells and produce graphs. Everything needed for the assignment is explained in the notebook. 

**How to submit**

You need to send the `.ipynb` file with your answers plus an `.html` file, which will serve as a backup for us in case the `.ipynb` file cannot be opened on my or the TA's computer. 

The homework solution should be uploaded on e-campus. You can submit it as often as you like before the deadline.

**Important**

- Please make sure that you provide an answer in each cell and place that contains the **[ your answer ]** tags.
- The places that require your code answer are marked with `"# YOUR CODE"` comments.
- Note that you may use 1 or more line of code for replacing each `"# YOUR CODE"` comment.

In [38]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd

# Pandas Basics (40 points)

Consider the series s of letters in a sentence

In [39]:
s = pd.Series(list("Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index."))

## Question 1a

What is count of each letter in the sentence, output a series which is sorted by the count?

In [40]:
#YOUR CODE HERE
s.value_counts()

     29
e    23
a    15
i    12
n    12
t    12
l    11
s    11
o    10
r    10
d     6
b     5
y     5
c     5
g     4
,     4
h     4
f     3
p     3
.     3
x     2
m     2
S     1
-     1
(     1
P     1
u     1
j     1
)     1
T     1
v     1
Name: count, dtype: int64

## Question 1b

Create a list with only the top 5 common letters (not including space)

In [41]:
#YOUR CODE HERE
s[s!=' '].head().tolist()

['S', 'e', 'r', 'i', 'e']

Given the dataframe below,

In [48]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C','D'])
df

                   A         B         C         D
2000-01-01 -1.002987  0.166569 -0.430852  0.034773
2000-01-02  0.803199  0.121378 -0.960178  0.850965
2000-01-03 -0.396989 -0.127535  0.656596  1.612120
2000-01-04 -0.999090  0.153343 -1.141821 -1.423651
2000-01-05 -0.295981  0.730385 -0.963417  0.619739
2000-01-06  1.073145  0.848842 -1.132548  0.429277
2000-01-07  2.629087  0.619454 -0.480123 -0.399494
2000-01-08  0.746178  0.867892  1.272050 -0.080315

## Question 1c

Find last two rows of columns A and D

In [65]:
#YOUR CODE HERE
df.iloc[-2:, [0, 3]]

                   A         D
2000-01-07  2.629087 -0.399494
2000-01-08  0.746178 -0.080315

## Question 1d

Find last three rows which satisfy that column A > Column B

In [68]:
#YOUR CODE HERE
df[df['A'] >= df['C']].tail(3)

                   A         B         C         D
2000-01-05 -0.295981  0.730385 -0.963417  0.619739
2000-01-06  1.073145  0.848842 -1.132548  0.429277
2000-01-07  2.629087  0.619454 -0.480123 -0.399494

# Baby Names Questions (30 points)

In [69]:
import urllib.request
import os.path
import zipfile

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # if the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

ca_name = 'NY.TXT'
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']
with zf.open(ca_name) as fh:
    babynames = pd.read_csv(fh, header=None, names=field_names)

babynames.sample(5)

       State Sex  Year      Name  Count
217971    NY   M  1970    Jerard      5
210358    NY   M  1963     Tarik      5
277162    NY   M  2008  Zakariya      9
97359     NY   F  1989   Nerissa      7
43740     NY   F  1959   Dorinda      9

## Question 2a

Write a line of code that creates a list (or Series or array) of all names that end with “ert”.

Your list should have only one instance of each name!

In [75]:
#YOUR CODE HERE
babynames[babynames['Name'].str.endswith('ert')]

       State Sex  Year     Name  Count
2531      NY   F  1914   Robert      7
3090      NY   F  1915   Robert     12
3919      NY   F  1916   Robert      8
4595      NY   F  1917   Robert     11
5202      NY   F  1918   Robert     19
...      ...  ..   ...      ...    ...
298145    NY   M  2018  Gilbert      7
298149    NY   M  2018  Herbert      7
298771    NY   M  2019   Robert    303
299026    NY   M  2019   Albert     57
300175    NY   M  2019  Gilbert      7

[1092 rows x 5 columns]

## Question 2b

Find the number of babies born in each year of each sex.

First, build a table showing the total number of babies born of each sex in each year. One way is to groupby using both columns of interest.

In [ ]:
#YOUR CODE HERE

## Question 2c

Second, a more natural approach is to use a pivot table. Create a pivot table.

In [ ]:
#YOUR CODE HERE

# Enrollment Practice Questions (40 points)

In [ ]:
df = pd.read_csv("enrollments.csv", usecols=["Term", "Subject", "Number", "Title", "Enrollment Cnt", "Instructor"])
df.head()

,Term,Subject,Number,Title,Instructor,Enrollment Cnt
0,2018 Spring,Computer Science,9A,Programmers' Matlab,Carol Marshall; Paul Hilfinger,8
1,2018 Spring,Computer Science,9C,Programmers' C,Carol Marshall; Paul Hilfinger,11
2,2018 Spring,Computer Science,9E,Productive Unix Use,Carol Marshall; Paul Hilfinger,36
3,2018 Spring,Computer Science,9F,Programmers' C++,Carol Marshall; Paul Hilfinger,33
4,2018 Spring,Computer Science,9G,Programmers' Java,Carol Marshall; Paul Hilfinger,11

## Question 3a

Try to find all Spring offerings of this course. Note, this dataset only contains Spring offerings, so there's no need to filter based on semester. The official "Number" for this class is "C100".

In [ ]:
#YOUR CODE HERE

## Question 3b

Create a series where each row correspond to one subject (e.g. English), and each value corresponds to the average number of students for courses in that subject. For example, your series might have a row saying that the average number of students in a Computer Science class is 88.

In [ ]:
#YOUR CODE HERE

## Question 3c

Create a multi-indexed series where each row corresponds to one subject (e.g. English) offered during one semester (e.g. Spring 2017), and each value corresponds to the maximum number of students for courses in that subject during that semester. For example, you might have a row saying that the maximum number of students in a computer science course during Spring 2012 was 575.

In [ ]:
#YOUR CODE HERE

## Question 3d

Try to compute the size of the largest class ever taught by each instructor. This challenge is stated more vaguely on purpose. You'll have to decide what the data structure looks like. Your result should be sorted in decreasing order of class size.

In [ ]:
#YOUR CODE HERE